[
    {
        "key": "analysis_name",
        "title": "Name of the analysis"
    },
    {
        "key": "dataset_name",
        "title": "Dataset",
        "titleMap": "$DATASETS"
    },
    {
      "type": "section",
      "title": "Advanced settings",
      "expandable": true,
      "expanded": false,
      "items":
      [
          { "widget": "message", "message": "<h3>Number of final components</h3>" },
          "n_components",
          { "widget": "message", "message": "<h3>Perplexity</h3>" },
          {
              "type": "help",
              "helpvalue": "The perplexity is related to the number of nearest neighbors that is used in other manifold learning algorithms. Larger datasets usually require a larger perplexity. Consider selecting a value between 5 and 50. The choice is not extremely critical since t-SNE is quite insensitive to this parameter."
          },
          "perplexity",
          { "widget": "message", "message": "<h3>Early Exaggeration</h3>" },
          {
              "type": "help",
              "helpvalue": "Controls how tight natural clusters in the original space are in the embedded space and how much space will be between them. For larger values, the space between natural clusters will be larger in the embedded space. Again, the choice of this parameter is not very critical. If the cost function increases during initial optimization, the early exaggeration factor or the learning rate might be too high."
          },
          "early_exaggeration",
          { "widget": "message", "message": "<h3>Learning Rate</h3>" },
          {
              "type": "help",
              "helpvalue": "The learning rate for t-SNE. If the learning rate is too high, the data may look like a 'ball' with any point approximately equidistant from its nearest neighbours. If the learning rate is too low, most points may look compressed in a dense cloud with few outliers. If the cost function gets stuck in a bad local minimum increasing the learning rate may help."
          },
          "learning_rate",
          { "widget": "message", "message": "<h3>Stop Condition - Iterations</h3>" },
          {
              "type": "help",
              "helpvalue": "Maximum number of iterations for the optimization."
          },
          "n_iter",
          { "widget": "message", "message": "<h3>Stop Condition - No Progress</h3>" },
          {
              "type": "help",
              "helpvalue": "Maximum number of iterations without progress before we abort the optimization, used after 250 initial iterations with early exaggeration."
          },
          "n_iter_without_progress",
          { "widget": "message", "message": "<h3>Stop Condition - Gradient</h3>" },
          {
              "type": "help",
              "helpvalue": "If the gradient norm is below this threshold, the optimization will be stopped."
          },
          "min_grad_norm",
          { "widget": "message", "message": "<h3>Distance Metric</h3>" },
          "metric",
          { "widget": "message", "message": "<h3>Initialization Method</h3>" },
          "init",
          { "widget": "message", "message": "<h3>Random Number Generator</h3>" },
          {
              "type": "help",
              "helpvalue": "Initialization of random number generator"
          },
          "random_state",
          { "widget": "message", "message": "<h3>Calculations Method</h3>" },
          {
              "type": "help",
              "helpvalue": "By default the gradient calculation algorithm uses Barnes-Hut approximation running in O(NlogN) time. method='exact' will run on the slower, but exact, algorithm in O(N^2) time. The exact algorithm should be used when nearest-neighbor errors need to be better than 3%. However, the exact method cannot scale to millions of examples."
          },
          "method",
          { "widget": "message", "message": "<h3>Angle</h3>" },
          {
              "type": "help",
              "helpvalue": "Only used if method='barnes_hut' This is the trade-off between speed and accuracy for Barnes-Hut T-SNE. 'angle' is the angular size of a distant node as measured from a point. If this size is below 'angle' then it is used as a summary node of all points contained within it. This method is not very sensitive to changes in this parameter in the range of 0.2 - 0.8. Angle less than 0.2 has quickly increasing computation time and angle greater 0.8 has quickly increasing error."
          },
          "angle"
      ]
    }
]